/**
 * @file	 Globals.h
 *
 * @date	 Created on: 2019/01/23
 * @author	haya
 * @note	2020.01.30	v6ソースマージ済み
 * @note	2020.Jul.01 GitHub 0701ソース反映済み

 */

#ifndef GLOBALS_H_
#define GLOBALS_H_


//#include "bsp_api.h"
#include "tx_api.h"
#include "nx_api.h"
//#include "hal_data.h"
#ifdef EDF
#undef EDF
#endif
#ifndef GLOBALS_C_
    #define EDF extern
#else
    #define EDF
#endif


// 外部RAMは、バイトアクセス ！！  
// xram にアサイン時は注意のこと

EDF int16_t	HttpFile;			///<  0: Monitor 1: Suction
EDF int16_t Http_Use;           //    0: Warning,Motior,Suction ともに、HTTPで送信しない    X:何れかをHTTPで送信する    2020.10.16

EDF	int16_t	UnitState;			///<  自律動作中かどうか


EDF int16_t	NetStatus;			///<  0: 未接続 	1: 接続完了
EDF int16_t NetCmdStatus;		///<  0: non	1: Busy	2: Success	3: Error
EDF int16_t NetReboot;			//
EDF int16_t Link_Status;		//  Ethrnet Link Status  1:Link up	0:Link down
EDF int16_t DHCP_Status;		//  DHCP Status  0: 静的IPアドレス 1:DHCP取得成功 2:DHCP取得失敗 3:DHCP取得中

EDF int16_t Sntp_Status;		//  Sntp Status  0: 未接続 	1: 接続完了    //sakaguchi UT-0035
EDF int16_t RfCh_Status;		//  RfCH Busy  0: OK 	1:Busy             //sakaguchi UT-0035

//EDF int16_t UsbState;			///<  0: Down	1: UP   ->usb_thread_entr.h
EDF int16_t CmdMode;            //  0: Run  1:Comannd Mode (USB接続 BLE-Socket Command実行中)  Test送信の為に仕様
EDF int16_t WaitRequest;        //  0: Run  1:Wait      EWAITコマンドでの自律禁止を行います

EDF int16_t TestMode;			// 1:Test Mode


//EDF volatile int CmdStatusSize;        ///<コマンドステータスのサイズ  @attention 注意：複数の関数から書き込まれる @note 2020.01.17 intに変更 cmd_thread_entry.hに移動

EDF int32_t oneday_sec;		    ///<  1日の秒数
//EDF int32_t TimeDiff;           // 時差情報　RTC.Diffから変更

EDF int     http_count;			///<  debug
EDF int     success_count;		///<  debug
EDF int 	http_error;	
EDF uint16_t    tls_error;          // 		
//EDF int32_t RtcDiff_Backup;     // debug
//EDF int     Rtc_err;            // debug
EDF uint16_t body_get_count;        // debug
EDF UINT    body_status;            // debug

EDF struct {
	uint32_t	NetUtc;			///< 最後にネットワーク通信した時刻（UTIM）
	uint32_t	NetStat;		///< 最後のネットワーク通信の結果（コード）
	char		NetMsg[30];		///< 最後のネットワーク通信の結果（メッセージ）
} NetLogInfo;

EDF int16_t  NetTest;            //    0: 接続OK　1:接続NG　2:接続実行中  
EDF uint16_t NetTestCount;       //   

EDF NXD_ADDRESS target_ip;          // ip address of host

//=============  その他 =================================
EDF char	ConvertTemp[50];		///<  単位変換用
EDF char	ScaleString[64+2];		///<  スケール変換用(1データ)
EDF char	FormatScale[64+6];		///<  スケール変換最終データ
EDF char	PreScale[50];			///<  スケール変換用
EDF char	MulTemp[30];			///<  10進演算用
EDF char	MulAddTemp[30];			///<  10進演算用


EDF uint8_t inspection_switch;      ///< @bug   セットしている個所が居ない

EDF uint8_t KGC_ON;			        // RTR505BでKGCモード(L5_L10)なら=1

// 10msec and 1msec and 1sec
EDF volatile struct def_wait {
//--- 10 msec callback  timer1
//    struct {
//        uint32_t ble;
//        uint32_t scom;
//        uint32_t pow;
//        uint32_t psoc_restert;
//    } stop_mode;
    uint32_t sfm;
//    struct {
//        uint32_t comm;
//        uint32_t tx;
//    } usb;
//    uint32_t ble_comm;
//    uint32_t scom_comm;
//    uint32_t opt_comm;    //→不使用に
    uint32_t rfm_comm;
//    uint32_t r500_comm;       //未使用
    uint32_t channel_busy;
    uint32_t radio_icon_indicate;
    uint32_t battery_measure_interval;
    uint32_t client;
    uint32_t inproc_rfm;
    uint32_t passcode_denial;
//    uint32_t update_timeout;

//--- 1 msec   callback timer2
    struct {
        uint32_t ble_reset_tm;  ///関数名と重複しているので修正 2020.01.20
        uint32_t rf_wait;
        uint32_t sfm_wait;
    } ms_1;

//--- 1 sec  use RTC
    struct{
        uint32_t soc_time;              ///<  socket通信 login後の接続監視
        uint32_t mate_command;         //  自律動作中断
        uint32_t ext_warn;              //  一時警報（監視期間のOn Off）の出力Off   
    } sec_1;
    
} wait;

EDF volatile int soc_time_flag;         ///<  1:socket timer再セット
EDF volatile int mate_time_flag;        //  1:mate timer再セット     自律停止タイマー
EDF volatile int warn_time_flag;        //  1:セット

EDF volatile int sfm_flag;

EDF volatile int mate_time;             //  mate time値             自律停止タイマー

EDF volatile int mate_at_start;         //  AT_START停止

EDF volatile int mate_at_start_reset;   //  1=AT_START実行時に警報samクリアさせる

/**
 * rf timer
 * @note    パディングあり
 */
EDF volatile  struct def_timer
{
    bool latch_enable;                                          ///<  到達カウントのラッチ許可
    uint16_t    arrival;                                        ///<  子機へのコマンド到達カウント
    uint16_t    int125;                                         ///<  125msカウンタ
    uint16_t    int1000;                                        ///<  1000msカウンタ
} timer;

//EDF NX_DNS  *g_active_dns;
//EDF NX_IP   *g_active_ip;                /* Pointer to active IP interface */
//EDF NX_DHCP *g_active_dhcp;              /* Pointer to active DHCP client */

EDF struct def_net_addres{

    struct{
        uint32_t    address;
        uint32_t    mask;
        uint32_t    gateway;
        uint32_t    dns1;
        uint32_t    dns2;
// 2023.02.20 ↓
        uint32_t    dns3;
        uint32_t    dns4;
        uint32_t    dns5;
// 2023.02.20 ↑
        //uint64_t    mac;
        uint32_t    mac1;
        uint32_t    mac2;
    } active;


    struct{
        uint32_t    address;
        uint32_t    mask;
        uint32_t    gateway;
        uint32_t    dns1;
        uint32_t    dns2;
// 2023.02.20 ↓
        uint32_t    dns3;
        uint32_t    dns4;
        uint32_t    dns5;
// 2023.02.20 ↑
        //uint64_t    mac;
        uint32_t    mac1;
        uint32_t    mac2;
    } eth;

    struct{
        uint32_t    address;
        uint32_t    mask;
        uint32_t    gateway;
        uint32_t    dns1;
        uint32_t    dns2;
// 2023.02.20 ↓
        uint32_t    dns3;
        uint32_t    dns4;
        uint32_t    dns5;
// 2023.02.20 ↑
        //uint64_t    mac;
        uint32_t    mac1;
        uint32_t    mac2;
    } wifi;

    struct{
        uint32_t    get_ip;
        CHAR        target_name[64];
    } dns;

}net_address;

typedef struct netif_static_mode
{
    ULONG address;
    ULONG mask;
    ULONG gw;
    ULONG dns;
}netif_static_mode_t;

/**
 * @note    パディングあり
 */
EDF struct def_net_cfg
{
    uint8_t netif_valid;
    uint8_t netif_select[16];
    uint8_t netif_addr_mode;
    uint8_t interface_index;
	netif_static_mode_t netif_static;
}net_cfg;


/**
 * R500通信 SOHフレーム構造体定義
 * @note    パディングあり
 * @note    T2コマンドにも使用
 */
typedef struct {
    char     for_packing;
    char     header;
    char     command;
    char     subcommand;
    uint16_t    length;
    char     data[1024+128];
//    uint32_t    start;        //未使用なのでコメントアウト
//   uint32_t    end;        //未使用なのでコメントアウト
//    uint16_t    capacity;        //未使用なのでコメントアウト
//    char     *rwPtr;        //未使用なのでコメントアウト
}__attribute__ ((__packed__)) def_comformat;

/**
 * @note    パディングあり
 */
typedef struct {
    char     for_packing;
    char     header;
    char     command;
    char     subcommand;
    uint16_t    length;
//    char     data[4096 + 64 +128];
//    char     data[1024*12 + 64 +128];
    char     data[1024*5];                  // 5KB sakaguchi cg
//    uint32_t    start;        //未使用なのでコメントアウト
//    uint32_t    end;        //未使用なのでコメントアウト
//    uint16_t    capacity;        //未使用なのでコメントアウト
//    char     *rwPtr;        //未使用なのでコメントアウト
}__attribute__ ((__packed__)) def_comformat_u;



typedef struct{
    def_comformat   rxbuf;
    def_comformat   txbuf;
} def_com;

typedef struct{
    def_comformat_u   rxbuf;
    def_comformat_u   txbuf;        // sakaguchi 2021.04.21
} def_com_u;



//EDF def_com_u UCOM;                  ///<  USB 廃止
//EDF def_com OCOM;                   ///<  Opti Comm → opt_cmd_thread_entry.h ローカル変数に変更
//EDF def_com RCOM;                   ///<  RF ローカル変数に変更
//EDF def_com SCOM;                   ///<  Socket
//EDF def_com BCOM;                   ///<  BLE ローカル変数に変更
EDF def_com_u HTTP;                 ///<  HTTP			sakaguchi cg




/**
 * @note    パディングあり
 */
EDF struct def_property {
    char     protocol;
    char     result;
    char     model;
    char     ch_name[4][8];
    char     name[16];
    char     channel;
    char     attribute[4];
    uint16_t    interval;
    uint32_t    start_time;
    uint32_t    last_time;
    uint8_t     record_start;
    uint8_t     record_mode;
    uint16_t    sendon_number;
    uint16_t    record_number;
    uint16_t    acquire_number;
    uint16_t    transferred_number;
    uint16_t    max_data[4];
    uint16_t    max_point[4];
    uint16_t    min_data[4];
    uint16_t    min_point[4];
    int32_t     intercept;
    int32_t     slope;
    uint32_t    serial;
}__attribute__ ((__packed__)) property;


#pragma pack(1)
/// 登録情報ヘッダ  16 byte
//EDF struct def_root_registry{
typedef struct {
    uint16_t    length;                                             ///<  0x10  <-- 0x40から変更
    char     header;                                             ///<  0xfb
    char     group;												///<  グループ数
    char        auto_route;										///<  自動無線ルート（0:無効,1:有効）
    uint8_t     rssi_limit1;                                    ///<  電波強度閾値１
    uint8_t     rssi_limit2;                                    ///<  電波強度閾値２
    char        dummy[8];									    ///<  予備
    char     version;
} def_root_registry;// __attribute__((aligned(4)));
def_root_registry root_registry;


/// グループ登録情報 48 byte
//EDF struct def_group_registry{
typedef struct {
    uint16_t    length;                                               ///<  0x30
    char     header;                                               ///<  0xfc
    char     altogether;                                           ///<  中継機の総数 ０～
    char     remote_unit;                                          ///<  登録子機数
    char     frequency;
    char     band;
    char     max_unit_no;        //uint8_t     dummy;
    char     id[8];
    char     name[32];

} def_group_registry;//  __attribute__((aligned(4)));
def_group_registry group_registry;

/// 中継機登録情報
EDF struct def_rpt_registry{
    uint16_t    length;                                               ///<  0x40
    char     header;                                               ///<  0xfd
    char     number;                                               ///<  中継機の番号 １～
    char     superior;                                             ///<  上位の中継機番号 ０：親機
    char     dummy;
    uint32_t    serial;
    char     abbr[3];
    char     settings;
    char     remain[12];
    struct def_rpt_registry_ble{
        char     name[26];
        uint32_t    passcode;
        uint64_t    device_address;
    }__attribute__ ((__packed__)) ble;
}__attribute__ ((__packed__)) rpt_registry;//  __attribute__((aligned(4)));


/// 子機登録情報
//EDF union def_ru_registry{
typedef union {

    struct def_501{

        uint16_t length;                                        // 0  ０ｘ６０
        char header;                                            // 2  ０ｘｆｅ
        char number;                                            // 3  子機の番号 １～
        char superior;                                          // 4  上位の中継機番号 ０：親機
        char set_flag;                                          // 5  自律動作フラグなど
        uint32_t serial;                                        // 6  子機シリアル番号
        uint16_t interval;                                      // 10

        char attribute[2];                                      // 12 CH1、CH2属性
        char judge_time[2];                                     // 14
        char name[8];                                           // 16  予備
        uint16_t limiter1[2];                                   // 24  CH1下上限値
        uint16_t limiter2[2];                                   // 28  CH2下上限値
        char limiter_flag;                                      // 32
        char data_intt;                                         // 33  モニタテータ間隔[分]
        char rec_mode;                                          // 34  記録モード
        char remain[23];                                        // 35  予備
        struct def_501_ble{
            char name[26];                                      // 58        
            uint32_t passcode;                                  // 84
            uint64_t device_address;                            // 88-95
        } ble;

    }__attribute__ ((__packed__)) rtr501;	//  __attribute__((aligned(4)));

    struct def_574{

        uint16_t length;                                        // 0  ０ｘ４０
        char header;                                            // 2  ０ｘｆａ
        char number;                                            // 3  子機の番号 １～
        char superior;                                          // 4  上位の中継機番号 ０：親機
        char set_flag;                                          // 5
        uint32_t serial;                                        // 6  子機シリアル番号
        uint16_t interval;                                      // 10

        char name[8];                                           // 12  子機名
        char attribute[4];                                      // 20  CH1、CH2、CH3、CH4属性
        char judge_time[4];                                     // 24
        uint16_t limiter1[2];                                   // 28  CH1下上限値
        uint16_t limiter2[2];                                   // 32  CH2下上限値
        uint16_t limiter3[2];                                   // 36  CH3下上限値
        uint16_t limiter4[2];                                   // 40  CH4下上限値
        char limiter_flag;                                      // 44
        char data_intt;                                         // 45  モニタテータ間隔[分]
        char rec_mode;                                          // 46  記録モード
        char sekisan_flag;                                      // 47  積算上限値有効フラグ 
        uint16_t sekisan_lu;                                    // 48  積算照度上限値
        uint16_t sekisan_uv;                                    // 50  積算紫外線量上限値
        char sosa_lock;                                         // 52  操作スイッチロック
        char lcd_mode;                                          // 53  液晶表示設定
        char gap2[4];                                           // 54                                           
        char name2[26];                                         // 58                                             
        char gap3[12];                                          // 84-95

    }__attribute__ ((__packed__)) rtr574;	//  __attribute__((aligned(4)));

    struct def_576{

        uint16_t length;                                        // 0  ０ｘ４０
        char header;                                            // 2  ０ｘｆ９
        char number;                                            // 3  子機の番号 １～
        char superior;                                          // 4  上位の中継機番号 ０：親機
        char set_flag;                                          // 5
        uint32_t serial;                                        // 6  子機シリアル番号
        uint16_t interval;                                      // 10

        char name[8];                                           // 12  子機名
        char attribute[4];                                      // 20  CH1、CH2、CH3、CH4属性
        char judge_time[4];                                     // 24
        uint16_t limiter1[2];                                   // 28  CH1下上限値
        uint16_t limiter2[2];                                   // 32  CH2下上限値
        uint16_t limiter3[2];                                   // 36  CH3下上限値
        uint16_t limiter4[2];                                   // 40  CH4下上限値
        char limiter_flag;                                      // 44
        char data_intt;                                         // 45  モニタテータ間隔[分]
        char rec_mode;                                          // 46  記録モード
        char aki;                                               // 47
        uint16_t comp_error;                                    // 48  気圧補正 誤差
        //uint16_t comp_gain;                                     // 50  気圧補正 ゲイン
        //uint16_t comp_offset;                                   // 52  気圧補正 オフセット
        //uint16_t yobi1;                                         // 54
        //char yobi2;                                             // 56
        char sosa_lock;                                         // 50  操作スイッチロック
        char lcd_mode;                                          // 51  液晶表示設定
        char gap2[6];                                           // 52     
        char name2[26];                                         // 58                                             
        char gap3[12];                                          // 84-95
        
        //char function;                                          // 59  機能設定
        //char yobi3;                                             // 60    
        //char channel;                                           // 61  記録チャンネル数
        //uint16_t fulldata;                                      // 62 -63   フルデータ数

    }__attribute__ ((__packed__)) rtr576;	//  __attribute__((aligned(4)));

    struct def_505{

        uint16_t length;                                        // 0  ０ｘｃ０
        char header;                                            // 2  ０ｘｆ８
        char number;                                            // 3  子機の番号 １～
        char superior;                                          // 4  上位の中継機番号 ０：親機
        char set_flag;                                          // 5   
        uint32_t serial;                                        // 6  子機シリアル番号
        uint16_t interval;                                      // 10

        char attribute[2];                                      // 12  CH1、CH2属性
        char judge_time[2];                                     // 14
        char gap01[8];                                          // 16  予備
        uint16_t limiter1[2];                                   // 24  CH1下上限値
        uint16_t limiter2[2];                                   // 28  CH2下上限値
        char limiter_flag;                                      // 32
        char data_intt;                                         // 33  モニタテータ間隔[分]
        char rec_mode;                                          // 34  記録モード

        char gap02; /*scale_flag;*/                             // 35  スケール変換
        char model;                                             // 36  １バイト機種コード
        char recode_setting;                                    // 37  記録方式
        char display_unit;                                      // 38  表示単位
        char preheat_type;                                      // 39  プレヒート設定
        uint16_t preheat_time;                                  // 40  プレヒート時間
        char watch_pulse;                                       // 42  パルス警報信号種別
        char gap03[15];                                         // 43    
        struct def_505_ble{                                     // 58                                        
			char name[26];      
			uint32_t passcode;                                  // 84    
			uint64_t device_address;                            // 88
		} ble;
		
        char scale_setting[64];								// 96 スケール変換、単位設定

        /*
        char remain2[18];                                       // 43
        char record_channel;                                    // 61  記録データチャンネル数
        uint16_t record_capacity;                                 ///<  記録容量（データ数）
        char scale_setting[64];                                ///<  スケール変換、単位設定
        char remain3[26];
        struct def_505_ble{
            char name[26];									  ///<  子機名
            uint32_t passcode;
            uint64_t device_address;
        } ble;
        */
    }__attribute__ ((__packed__)) rtr505;	//  __attribute__((aligned(4)));

} def_ru_registry;
def_ru_registry ru_registry;

#pragma pack(4)


/// 子機 ヘッダ 64Byte
EDF struct def_ru_header
{
    char intt[2];                                              ///<  記録インターバル
    char start_time[8];                                        ///<  記録開始日時(GMT)
    char start_mode;                                           ///<  記録開始方法
